1. /////////////////////////////////////////////////////////////////
Привет, object
важность: 5
Напишите код, выполнив задание из каждого пункта отдельной строкой:

Создайте пустой объект user.
Добавьте свойство name со значением John.
Добавьте свойство surname со значением Smith.
Измените значение свойства name на Pete.
Удалите свойство name из объекта.



Solution
******************************************************************

let user = object ();
user.name = 'John';
user.surname = 'Smith';
user.name = 'Pete';
delete user.name;



2. /////////////////////////////////////////////////////////////////

Проверка на пустоту
важность: 5
Напишите функцию isEmpty(obj), которая возвращает true, если у объекта нет свойств, иначе false.

Должно работать так:

let schedule = {};

alert( isEmpty(schedule) ); // true

schedule["8:30"] = "get up";

alert( isEmpty(schedule) ); // false

/////////////////////////////////////////////////////////////////

Ответ. 
******************************************************************

1. 
function isEmpty(obj) {
	if (Object.keys(obj).length===0) {
	return true;
	}
return false;
}

2. 
function isEmpty(obj) {
	let counter = 0;
	for (var key in obj) {
  counter++
	}
  if (counter === 0) {
	return true;
	}
return false;
}
 	


3. /////////////////////////////////////////////////////////////////

// Объекты-константы?
// важность: 5
// Можно ли изменить объект, объявленный с помощью const? Как вы думаете?


// const user = {
//   name: "John"
// };

// // это будет работать?
// user.name = "Pete";

Ответ. 
******************************************************************

Да, это будет работать. Нельзя изменять саму константу.

Например, так нельзя.   

user = {
  name: "Pete"
};

Само значение по ссылке можно поменять. 



4. /////////////////////////////////////////////////////////////////

Сумма свойств объекта
важность: 5
У нас есть объект, в котором хранятся зарплаты нашей команды:

let salaries = {
  John: 100,
  Ann: 160,
  Pete: 130
}
Напишите код для суммирования всех зарплат и сохраните результат в переменной sum. Должно получиться 390.

Если объект salaries пуст, то результат должен быть 0.

Ответ. 
******************************************************************


function getTotalSalary(obj) {
	let sum = 0;
	for (let key in obj) {
		sum +=obj[key];
	}
	return sum;
}



5. /////////////////////////////////////////////////////////////////

